{
    "projects-word": "Проекты",
    "showTech": "Нажмите для подробностей",
    "techUsed": "Используемые технологии",
    "view-project": "Посмотреть сайт",
    "code": "Код",
    "projects": [
        {
            "title": "Axi.com",
            "tagline": "Улучшения торговой платформы через оптимизацию backend-логики.",
            "desc": "Реструктурировал и оптимизировал ключевые части бизнес-логики, внедрив модульный и переиспользуемый код по всей платформе. Улучшил удобство и функциональность административной панели, добавил новые функции, которыми пользуются тысячи активных трейдеров.",
            "techs": [
                "C# и ASP.NET Core",
                "Vue.js",
                "SQL",
                "Чистая архитектура",
                "Разработка админ-панели",
                "Компонентный UI"
            ]
        },
        {
            "title": "CruiseOffers",
            "tagline": "Улучшение UX через рефакторинг и новые функции.",
            "desc": "Провёл масштабный рефакторинг backend и frontend кода. Внедрил понятную бизнес-логику, улучшил интерфейс админки и разработал новые функции, которые уже используются конечными пользователями.",
            "techs": [
                "C# и ASP.NET Core",
                "Vue.js",
                "SQL",
                "Рефакторинг и проектирование логики",
                "Улучшение UI/UX",
                "Оптимизация админки"
            ]
        },
        {
            "title": "Dutify – Microsoft Teams Bot",
            "tagline": "Автоматическая запись видео в Teams.",
            "desc": "Реализовал полный процесс видеозаписи для Teams-бота: от получения необработанных байтов до их кодирования и синхронизации. Функционал позволяет автоматически записывать встречи, воспроизводить их и использовать в отчётах.",
            "techs": [
                "C# и .NET",
                "Медиа-кодирование",
                "FFmpeg",
                "Microsoft Teams Bot API",
                "Обработка сигналов",
                "Асинхронные потоки"
            ]
        },
        {
            "title": "CRM-система Holberton",
            "tagline": "Управление жизненным циклом студентов с модульной архитектурой.",
            "desc": "Разработал внутреннюю CRM-систему для Holberton School Azerbaijan, чтобы управлять студентами и курсами. Реализовал RBAC, модульную структуру и юнит-тесты. Как тимлид, отвечал за архитектуру, интеграцию фронтенда и backend, а также взаимодействие с DevOps.",
            "techs": [
                "C# и ASP.NET Core",
                "Entity Framework Core",
                "RBAC",
                "Юнит-тесты (xUnit)",
                "Модульная архитектура",
                "Agile-сотрудничество"
            ]
        },
        {
            "title": "Yallı",
            "tagline": "Найди соотечественников там, где ты живёшь",
            "desc": "Yallı — социальная платформа для азербайджанцев, проживающих за рубежом. Пользователи могут находить и общаться с земляками, живущими в той же стране, и укреплять связи с диаспорой. Удобный интерфейс, интерактивная карта и профили пользователей обеспечивают простой и приятный опыт.",
            "techs": [
                "React.js",
                "SCSS",
                "Redux",
                "JavaScript"
            ]
        },
        {
            "title": "StudenV",
            "tagline": "Цифровое пространство для студенческого сообщества",
            "desc": "StudenV — цифровая платформа для студентов, где они могут делиться опытом, заводить новых друзей и обмениваться полезной информацией. Форумы, мероприятия и разделы с ресурсами делают учебную жизнь более активной и полезной.",
            "techs": [
                "Next.js",
                "Tailwind CSS",
                "Zustand",
                "TypeScript"
            ]
        },
        {
            "title": "Fully Pictured Solutions",
            "tagline": "Услуги фото- и видеосъёмки",
            "desc": "Fully Pictured Solutions — платформа для заказа профессиональных фото- и видеосъёмок. Пользователи могут легко бронировать съёмки для свадеб, мероприятий и портретов, просматривать портфолио и узнавать подробности об услугах. Отличается стильным дизайном и удобным интерфейсом.",
            "techs": [
                "Next.js",
                "SCSS",
                "Tailwind CSS",
                "Zustand",
                "TypeScript"
            ]
        },
        {
            "title": "VitaMail",
            "tagline": "Сервис проверки email-адресов",
            "desc": "VitaMail — быстрый и точный инструмент для проверки корректности и активности email-адресов. Поддерживает массовую проверку и предоставляет результаты в реальном времени, помогая очищать и поддерживать актуальные базы подписчиков.",
            "techs": [
                "Next.js",
                "SCSS",
                "Tailwind CSS",
                "Zustand",
                "TypeScript"
            ]
        },
        {
            "title": "AI Tools",
            "tagline": "Бесплатные инструменты на базе ИИ",
            "desc": "AI Tools предлагает набор бесплатных AI-инструментов — генерация текста, анализ изображений, создание контента для соцсетей и многое другое. Простой интерфейс и практичные результаты делают ИИ доступным для каждого.",
            "techs": [
                "Next.js",
                "SCSS",
                "Tailwind CSS",
                "Zustand",
                "TypeScript"
            ]
        },
        {
            "title": "Boston Pro Car Service",
            "tagline": "Премиальные услуги лимузинов",
            "desc": "Boston Pro Car Service предоставляет премиальные услуги лимузинов и водителей в Бостоне и ближайших районах. Пользователи могут легко бронировать трансферы в аэропорт, корпоративные и частные поездки.",
            "techs": [
                "Next.js",
                "SCSS",
                "Tailwind CSS",
                "Zustand",
                "TypeScript"
            ]
        },
        {
            "title": "Appro Appliance Service",
            "tagline": "Ремонт техники в тот же день",
            "desc": "Appro Appliance Service — это профессиональный сервис, предлагающий срочный ремонт бытовой техники. Пользователи могут заказать ремонт холодильников, плит, стиральных машин и других устройств через простую онлайн-форму.",
            "techs": [
                "Next.js",
                "SCSS",
                "Tailwind CSS",
                "Zustand",
                "TypeScript"
            ]
        }
    ]
}